# Outline

1. DataFrame
2. Filtering DataFrame
3. Manipulating DataFrame
4. Sorting
5. Grouping
6. Rearanging
7. Ranking
8. Some Plots

### 1. DataFrame

pemanggilan library

In [1]:
import pandas as pd
import numpy as np

#### A. Pendefinisian Dataframe

In [2]:
asia = ['Indonesia','Jepang','China']
eropa = ['Inggris','Italia','Prancis']
afrika = ['Ghana','Zimbawe','Mesir']

kamus_benua = {'benua asia':asia,
               'benua eropa':eropa,
               'benua afrika':afrika}

In [3]:
benua_negara = pd.DataFrame(kamus_benua)

In [4]:
benua_negara

  benua afrika benua asia benua eropa
0        Ghana  Indonesia     Inggris
1      Zimbawe     Jepang      Italia
2        Mesir      China     Prancis

In [5]:
data = {'year':[2010,2011,2012,
                2010,2011,2012,
                2010,2011,2012],
        'team':['FCBarcelona','FCBarcelona','FCBarcelona','RMadrid','RMadrid','RMadrid','ValemciaCF','ValemciaCF','ValemciaCF'],
       'Wins':[20,28,32,29,32,26,21,
               17,19],
       'draws':[6,7,4,5,4,7,8,10,8],
       'losses':[2,3,2,4,2,5,9,11,11]}

In [6]:
football = pd.DataFrame(data,columns = ['year','team','Wins','draws','losses'])

In [7]:
print(football)

   year         team  Wins  draws  losses
0  2010  FCBarcelona    20      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValemciaCF    21      8       9
7  2011   ValemciaCF    17     10      11
8  2012   ValemciaCF    19      8      11

In [8]:
list = [[2,3,4],[1,2,3]]

In [9]:
pd.DataFrame(list)

   0  1  2
0  2  3  4
1  1  2  3

In [10]:
football['Poin'] =  football['Wins']*3 + football['draws']*1+football['losses']*0

In [11]:
football

   year         team  Wins  draws  losses  Poin
0  2010  FCBarcelona    20      6       2    66
1  2011  FCBarcelona    28      7       3    91
2  2012  FCBarcelona    32      4       2   100
3  2010      RMadrid    29      5       4    92
4  2011      RMadrid    32      4       2   100
5  2012      RMadrid    26      7       5    85
6  2010   ValemciaCF    21      8       9    71
7  2011   ValemciaCF    17     10      11    61
8  2012   ValemciaCF    19      8      11    65

#### B. Import Dataframe

In [12]:
edu = pd.read_csv('educ_figdp_1_Data.csv',
                  na_values=':',
                  usecols=["TIME","GEO","Value"])

In [13]:
print(edu)

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
5    2005  European Union (28 countries)   4.92
6    2006  European Union (28 countries)   4.91
7    2007  European Union (28 countries)   4.92
8    2008  European Union (28 countries)   5.04
9    2009  European Union (28 countries)   5.38
10   2010  European Union (28 countries)   5.41
11   2011  European Union (28 countries)   5.25
12   2000  European Union (27 countries)   4.91
13   2001  European Union (27 countries)   4.99
14   2002  European Union (27 countries)   5.00
15   2003  European Union (27 countries)   5.04
16   2004  European Union (27 countries)   4.95
17   2005  European Union (27 countries)   4.92
18   2006  European Union (27 countries)   4.91
19   2007  European Union (27 countries)   4.93
20   2008  European Union (27 countries)   5.04
21   2009  European Union (27 countries)   5.38
22   2010  European Union (27 countries)   5.41
23   2011  European Union (27 countries)   5.25
24   2000  European Union (25 countries)   4.94
25   2001  European Union (25 countries)   5.02
26   2002  European Union (25 countries)   5.03
27   2003  European Union (25 countries)   5.06
28   2004  European Union (25 countries)   4.98
29   2005  European Union (25 countries)   4.95
..    ...                            ...    ...
354  2006                       Slovenia   5.72
355  2007                       Slovenia   5.15
356  2008                       Slovenia   5.20
357  2009                       Slovenia   5.69
358  2010                       Slovenia   5.68
359  2011                       Slovenia   5.68
360  2000                       Slovakia   3.92
361  2001                       Slovakia   3.99
362  2002                       Slovakia   4.31
363  2003                       Slovakia   4.30
364  2004                       Slovakia   4.19
365  2005                       Slovakia   3.85
366  2006                       Slovakia   3.80
367  2007                       Slovakia   3.62
368  2008                       Slovakia   3.61
369  2009                       Slovakia   4.09
370  2010                       Slovakia   4.22
371  2011                       Slovakia   4.06
372  2000                        Finland   5.89
373  2001                        Finland   6.06
374  2002                        Finland   6.22
375  2003                        Finland   6.43
376  2004                        Finland   6.42
377  2005                        Finland   6.30
378  2006                        Finland   6.18
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

#### C. Akses DataFrame

In [14]:
# menampilkan data awal
edu.head(3)

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)    5.0

In [15]:
# menampilkan data akhir
edu.tail(10)

     TIME      GEO  Value
374  2002  Finland   6.22
375  2003  Finland   6.43
376  2004  Finland   6.42
377  2005  Finland   6.30
378  2006  Finland   6.18
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [16]:
# statistika deskriptif
edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

In [17]:
## akses kolom 
edu['Value']

0       NaN
1       NaN
2      5.00
3      5.03
4      4.95
5      4.92
6      4.91
7      4.92
8      5.04
9      5.38
10     5.41
11     5.25
12     4.91
13     4.99
14     5.00
15     5.04
16     4.95
17     4.92
18     4.91
19     4.93
20     5.04
21     5.38
22     5.41
23     5.25
24     4.94
25     5.02
26     5.03
27     5.06
28     4.98
29     4.95
       ...
354    5.72
355    5.15
356    5.20
357    5.69
358    5.68
359    5.68
360    3.92
361    3.99
362    4.31
363    4.30
364    4.19
365    3.85
366    3.80
367    3.62
368    3.61
369    4.09
370    4.22
371    4.06
372    5.89
373    6.06
374    6.22
375    6.43
376    6.42
377    6.30
378    6.18
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value, dtype: float64

In [18]:
edu[['Value','TIME']].head()

   Value  TIME
0    NaN  2000
1    NaN  2001
2   5.00  2002
3   5.03  2003
4   4.95  2004

In [20]:
edu[10:24]

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99
14  2002  European Union (27 countries)   5.00
15  2003  European Union (27 countries)   5.04
16  2004  European Union (27 countries)   4.95
17  2005  European Union (27 countries)   4.92
18  2006  European Union (27 countries)   4.91
19  2007  European Union (27 countries)   4.93
20  2008  European Union (27 countries)   5.04
21  2009  European Union (27 countries)   5.38
22  2010  European Union (27 countries)   5.41
23  2011  European Union (27 countries)   5.25

In [21]:
edu.ix[90:94,['TIME','GEO']]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium

In [22]:
edu.ix[100:106,['TIME','Value']]

     TIME  Value
100  2004   4.40
101  2005   4.25
102  2006   4.04
103  2007   3.88
104  2008   4.44
105  2009   4.58
106  2010   4.10

### 2. Filtering DataFrame

In [23]:
edu[edu['Value'] > 3].head()

   TIME                            GEO  Value
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95
5  2005  European Union (28 countries)   4.92
6  2006  European Union (28 countries)   4.91

In [24]:
edu.isnull().sum(axis=0)

TIME      0
GEO       0
Value    23
dtype: int64

In [25]:
# manmpilkan baris yang ada missing value
edu[edu['Value'].isnull()]

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
36   2000       Euro area (18 countries)    NaN
37   2001       Euro area (18 countries)    NaN
48   2000       Euro area (17 countries)    NaN
49   2001       Euro area (17 countries)    NaN
60   2000       Euro area (15 countries)    NaN
72   2000       Euro area (13 countries)    NaN
84   2000                        Belgium    NaN
174  2006                         Greece    NaN
175  2007                         Greece    NaN
176  2008                         Greece    NaN
177  2009                         Greece    NaN
178  2010                         Greece    NaN
179  2011                         Greece    NaN
252  2000                     Luxembourg    NaN
260  2008                     Luxembourg    NaN
261  2009                     Luxembourg    NaN
262  2010                     Luxembourg    NaN
263  2011                     Luxembourg    NaN
342  2006                        Romania    NaN
344  2008                        Romania    NaN
348  2000                       Slovenia    NaN

In [26]:
print(edu.count())

TIME     384
GEO      384
Value    361
dtype: int64

In [27]:
edu['Value'].max()

8.81

### 3. Manipulating Data

In [28]:
# axis itu untuk kolom
edu.max(axis=0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object

In [29]:
# axis itu untuk baris
edu.max(axis=1)

0      2000.0
1      2001.0
2      2002.0
3      2003.0
4      2004.0
5      2005.0
6      2006.0
7      2007.0
8      2008.0
9      2009.0
10     2010.0
11     2011.0
12     2000.0
13     2001.0
14     2002.0
15     2003.0
16     2004.0
17     2005.0
18     2006.0
19     2007.0
20     2008.0
21     2009.0
22     2010.0
23     2011.0
24     2000.0
25     2001.0
26     2002.0
27     2003.0
28     2004.0
29     2005.0
        ...
354    2006.0
355    2007.0
356    2008.0
357    2009.0
358    2010.0
359    2011.0
360    2000.0
361    2001.0
362    2002.0
363    2003.0
364    2004.0
365    2005.0
366    2006.0
367    2007.0
368    2008.0
369    2009.0
370    2010.0
371    2011.0
372    2000.0
373    2001.0
374    2002.0
375    2003.0
376    2004.0
377    2005.0
378    2006.0
379    2007.0
380    2008.0
381    2009.0
382    2010.0
383    2011.0
dtype: float64

In [30]:
edu['Value'].max()

8.81

In [31]:
max(edu['TIME'])

2011

In [32]:
# terdapat data hilang pada peubah value 
print ("pandas", edu['Value'].max())
print ("pyhton", max(edu['Value']))

# tidak terdapat data hilang pada peubah TIME
print ("pandas", edu['TIME'].max())
print ("pyhton", max(edu['TIME']))

pandas 8.81
pyhton nan
pandas 2011
pyhton 2011

In [33]:
edu['new_var'] = edu['Value']/100
edu.head()

   TIME                            GEO  Value  new_var
0  2000  European Union (28 countries)    NaN      NaN
1  2001  European Union (28 countries)    NaN      NaN
2  2002  European Union (28 countries)   5.00   0.0500
3  2003  European Union (28 countries)   5.03   0.0503
4  2004  European Union (28 countries)   4.95   0.0495

In [34]:
edu['new_var2'] = np.sqrt(edu['Value'])
edu.head()

   TIME                            GEO  Value  new_var  new_var2
0  2000  European Union (28 countries)    NaN      NaN       NaN
1  2001  European Union (28 countries)    NaN      NaN       NaN
2  2002  European Union (28 countries)   5.00   0.0500  2.236068
3  2003  European Union (28 countries)   5.03   0.0503  2.242766
4  2004  European Union (28 countries)   4.95   0.0495  2.224860

In [35]:
s= edu['Value'].apply(np.sqrt)
s.head()

0         NaN
1         NaN
2    2.236068
3    2.242766
4    2.224860
Name: Value, dtype: float64

In [36]:
s = edu['Value'].apply(lambda d: d**2)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [37]:
## membuat variabel baru
edu['ValueNorm'] = edu['Value']/edu['Value'].max()
edu.tail()

     TIME      GEO  Value  new_var  new_var2  ValueNorm
379  2007  Finland   5.90   0.0590  2.428992   0.669694
380  2008  Finland   6.10   0.0610  2.469818   0.692395
381  2009  Finland   6.81   0.0681  2.609598   0.772985
382  2010  Finland   6.85   0.0685  2.617250   0.777526
383  2011  Finland   6.76   0.0676  2.600000   0.767310

In [38]:
print(edu.max())

TIME            2011
GEO            Spain
Value           8.81
new_var       0.0881
new_var2     2.96816
ValueNorm          1
dtype: object

In [39]:
edu

     TIME                            GEO  Value  new_var  new_var2  ValueNorm
0    2000  European Union (28 countries)    NaN      NaN       NaN        NaN
1    2001  European Union (28 countries)    NaN      NaN       NaN        NaN
2    2002  European Union (28 countries)   5.00   0.0500  2.236068   0.567537
3    2003  European Union (28 countries)   5.03   0.0503  2.242766   0.570942
4    2004  European Union (28 countries)   4.95   0.0495  2.224860   0.561862
5    2005  European Union (28 countries)   4.92   0.0492  2.218107   0.558456
6    2006  European Union (28 countries)   4.91   0.0491  2.215852   0.557321
7    2007  European Union (28 countries)   4.92   0.0492  2.218107   0.558456
8    2008  European Union (28 countries)   5.04   0.0504  2.244994   0.572077
9    2009  European Union (28 countries)   5.38   0.0538  2.319483   0.610670
10   2010  European Union (28 countries)   5.41   0.0541  2.325941   0.614075
11   2011  European Union (28 countries)   5.25   0.0525  2.291288   0.595914
12   2000  European Union (27 countries)   4.91   0.0491  2.215852   0.557321
13   2001  European Union (27 countries)   4.99   0.0499  2.233831   0.566402
14   2002  European Union (27 countries)   5.00   0.0500  2.236068   0.567537
15   2003  European Union (27 countries)   5.04   0.0504  2.244994   0.572077
16   2004  European Union (27 countries)   4.95   0.0495  2.224860   0.561862
17   2005  European Union (27 countries)   4.92   0.0492  2.218107   0.558456
18   2006  European Union (27 countries)   4.91   0.0491  2.215852   0.557321
19   2007  European Union (27 countries)   4.93   0.0493  2.220360   0.559591
20   2008  European Union (27 countries)   5.04   0.0504  2.244994   0.572077
21   2009  European Union (27 countries)   5.38   0.0538  2.319483   0.610670
22   2010  European Union (27 countries)   5.41   0.0541  2.325941   0.614075
23   2011  European Union (27 countries)   5.25   0.0525  2.291288   0.595914
24   2000  European Union (25 countries)   4.94   0.0494  2.222611   0.560726
25   2001  European Union (25 countries)   5.02   0.0502  2.240536   0.569807
26   2002  European Union (25 countries)   5.03   0.0503  2.242766   0.570942
27   2003  European Union (25 countries)   5.06   0.0506  2.249444   0.574347
28   2004  European Union (25 countries)   4.98   0.0498  2.231591   0.565267
29   2005  European Union (25 countries)   4.95   0.0495  2.224860   0.561862
..    ...                            ...    ...      ...       ...        ...
354  2006                       Slovenia   5.72   0.0572  2.391652   0.649262
355  2007                       Slovenia   5.15   0.0515  2.269361   0.584563
356  2008                       Slovenia   5.20   0.0520  2.280351   0.590238
357  2009                       Slovenia   5.69   0.0569  2.385372   0.645857
358  2010                       Slovenia   5.68   0.0568  2.383275   0.644722
359  2011                       Slovenia   5.68   0.0568  2.383275   0.644722
360  2000                       Slovakia   3.92   0.0392  1.979899   0.444949
361  2001                       Slovakia   3.99   0.0399  1.997498   0.452894
362  2002                       Slovakia   4.31   0.0431  2.076054   0.489217
363  2003                       Slovakia   4.30   0.0430  2.073644   0.488082
364  2004                       Slovakia   4.19   0.0419  2.046949   0.475596
365  2005                       Slovakia   3.85   0.0385  1.962142   0.437003
366  2006                       Slovakia   3.80   0.0380  1.949359   0.431328
367  2007                       Slovakia   3.62   0.0362  1.902630   0.410897
368  2008                       Slovakia   3.61   0.0361  1.900000   0.409762
369  2009                       Slovakia   4.09   0.0409  2.022375   0.464245
370  2010                       Slovakia   4.22   0.0422  2.054264   0.479001
371  2011                       Slovakia   4.06   0.0406  2.014944   0.460840
372  2000                        Finland   5.89   0.0589  2.426932   0.668558
373  2001                        Finland   6.06   0.0606  2.461707   0.687855
374  2002                        Finland   6.22   0.0622  2.493993   0.706016
375  2003                        Finland   6.43   0.0643  2.535744   0.729852
376  2004                        Finland   6.42   0.0642  2.533772   0.728717
377  2005                        Finland   6.30   0.0630  2.509980   0.715096
378  2006                        Finland   6.18   0.0618  2.485961   0.701476
379  2007                        Finland   5.90   0.0590  2.428992   0.669694
380  2008                        Finland   6.10   0.0610  2.469818   0.692395
381  2009                        Finland   6.81   0.0681  2.609598   0.772985
382  2010                        Finland   6.85   0.0685  2.617250   0.777526
383  2011                        Finland   6.76   0.0676  2.600000   0.767310

[384 rows x 6 columns]

In [40]:
## manmbah row baru dengan indeks (ignore_index=True)

edu = edu.append({"TIME":2000,"Value":5,"GEO":'a'},ignore_index=True)
edu.tail()

     TIME      GEO  Value  new_var  new_var2  ValueNorm
380  2008  Finland   6.10   0.0610  2.469818   0.692395
381  2009  Finland   6.81   0.0681  2.609598   0.772985
382  2010  Finland   6.85   0.0685  2.617250   0.777526
383  2011  Finland   6.76   0.0676  2.600000   0.767310
384  2000        a   5.00      NaN       NaN        NaN

In [41]:
## meremove data baris(axis=0) permanen (inplace=True)
edu.drop(max(edu.index),axis=0,inplace=True)
edu.tail()

     TIME      GEO  Value  new_var  new_var2  ValueNorm
379  2007  Finland   5.90   0.0590  2.428992   0.669694
380  2008  Finland   6.10   0.0610  2.469818   0.692395
381  2009  Finland   6.81   0.0681  2.609598   0.772985
382  2010  Finland   6.85   0.0685  2.617250   0.777526
383  2011  Finland   6.76   0.0676  2.600000   0.767310

In [42]:
## drop na berdasarkan kondisi ()
eduDrop = edu.dropna(how='any',subset=['Value'])
eduDrop.head()

   TIME                            GEO  Value  new_var  new_var2  ValueNorm
2  2002  European Union (28 countries)   5.00   0.0500  2.236068   0.567537
3  2003  European Union (28 countries)   5.03   0.0503  2.242766   0.570942
4  2004  European Union (28 countries)   4.95   0.0495  2.224860   0.561862
5  2005  European Union (28 countries)   4.92   0.0492  2.218107   0.558456
6  2006  European Union (28 countries)   4.91   0.0491  2.215852   0.557321

In [43]:
eduFilled = edu.fillna(value = {'Value': 0})
eduFilled.head()

   TIME                            GEO  Value  new_var  new_var2  ValueNorm
0  2000  European Union (28 countries)   0.00      NaN       NaN        NaN
1  2001  European Union (28 countries)   0.00      NaN       NaN        NaN
2  2002  European Union (28 countries)   5.00   0.0500  2.236068   0.567537
3  2003  European Union (28 countries)   5.03   0.0503  2.242766   0.570942
4  2004  European Union (28 countries)   4.95   0.0495  2.224860   0.561862

### 4. Sorting

In [44]:
# mengurutkan berdasrkan value
edu.sort_values(by='Value',ascending= False, inplace=True)
edu.head()

     TIME      GEO  Value  new_var  new_var2  ValueNorm
130  2010  Denmark   8.81   0.0881  2.968164   1.000000
131  2011  Denmark   8.75   0.0875  2.958040   0.993190
129  2009  Denmark   8.74   0.0874  2.956349   0.992054
121  2001  Denmark   8.44   0.0844  2.905168   0.958002
122  2002  Denmark   8.44   0.0844  2.905168   0.958002

In [45]:
# mengurutkan ke posisi awal
edu.sort_index(axis=0,ascending=True,inplace=True)
edu.head()

   TIME                            GEO  Value  new_var  new_var2  ValueNorm
0  2000  European Union (28 countries)    NaN      NaN       NaN        NaN
1  2001  European Union (28 countries)    NaN      NaN       NaN        NaN
2  2002  European Union (28 countries)   5.00   0.0500  2.236068   0.567537
3  2003  European Union (28 countries)   5.03   0.0503  2.242766   0.570942
4  2004  European Union (28 countries)   4.95   0.0495  2.224860   0.561862

### 5. Grouping Data

In [46]:
group = edu[["GEO","Value"]].groupby('GEO').mean()
group.head()

                   Value
GEO
Austria         5.618333
Belgium         6.189091
Bulgaria        4.093333
Cyprus          7.023333
Czech Republic  4.168333

### 6. Rearranging Data

In [47]:
filtered_data = edu[edu['TIME']>2005]
pivedu = pd.pivot_table(filtered_data,values='Value',
                       index=['GEO'],
                       columns= ["TIME"])
pivedu.head()

TIME            2006  2007  2008  2009  2010  2011
GEO
Austria         5.40  5.33  5.47  5.98  5.91  5.80
Belgium         5.98  6.00  6.43  6.57  6.58  6.55
Bulgaria        4.04  3.88  4.44  4.58  4.10  3.82
Cyprus          7.02  6.95  7.45  7.98  7.92  7.87
Czech Republic  4.42  4.05  3.92  4.36  4.25  4.51

In [48]:
pivedu.ix[['Cyprus','Bulgaria'],[2007,2009]]

TIME      2007  2009
GEO
Cyprus    6.95  7.98
Bulgaria  3.88  4.58

### 7. Rangking Data

In [49]:
pivedu = pivedu.drop([
    'Euro area (13 countries)',
    'Euro area (15 countries)',
    'Euro area (17 countries)',
    'Euro area (18 countries)',
    'European Union (25 countries)',
    'European Union (27 countries)',
    'European Union (28 countries)' 
],axis=0)

In [50]:
pivedu = pivedu.rename(index = {'Germany (until 1990 former territory of the FRG)':'Germany'})
pivedu = pivedu.dropna()

In [51]:
pivedu.rank(ascending=False,method='first').head()

TIME            2006  2007  2008  2009  2010  2011
GEO
Austria         10.0   7.0  11.0   7.0   8.0   8.0
Belgium          5.0   4.0   3.0   4.0   5.0   5.0
Bulgaria        21.0  21.0  20.0  20.0  22.0  22.0
Cyprus           2.0   2.0   2.0   2.0   2.0   3.0
Czech Republic  19.0  20.0  21.0  21.0  20.0  19.0

In [52]:
totalsum = pivedu.sum(axis=1)
totalsum.rank(ascending=False,method='dense').sort_values()

GEO
Denmark            1.0
Cyprus             2.0
Finland            3.0
Malta              4.0
Belgium            5.0
Ireland            6.0
France             7.0
Netherlands        8.0
Austria            9.0
Slovenia          10.0
Estonia           11.0
Portugal          12.0
Latvia            13.0
Hungary           14.0
Lithuania         15.0
Poland            16.0
Germany           17.0
Spain             18.0
Italy             19.0
Czech Republic    20.0
Bulgaria          21.0
Slovakia          22.0
dtype: float64

### 8. Some Plot

In [55]:
import matplotlib.pyplot as plt

In [53]:
totalsum = pivedu.sum(axis=1).sort_values(ascending=False)
totalsum.plot(kind='bar',style='b',alpha=0.4,title="Total Values for country")

In [54]:
plt.show()

NameError: name 'plt' is not defined

In [ ]:
my_colors = ['b','r','g','y','m','c']
ax = pivedu.plot(kind = 'barh'
                ,stacked=True
                ,color=my_colors)
ax.legend(loc='center left', bbox_to_anchor=(1, .5))

plt.show()